tap "aws/tap"
tap "hashicorp/tap"
brew "awscli"
brew "black"
brew "kubectx"
brew "rsync"
brew "sops"
brew "gnupg"
brew "testssl"
brew "readline"
brew "tree"
brew "ansible"
brew "argocd"
brew "azure-cli"
brew "bat"
brew "gping"
brew "bash-completion"
brew "jmeter"
brew "go"
brew "gopls"
brew "docker"
brew "docker-compose"
brew "bom"
brew "git"
brew "gh"
brew "grafana"
brew "grpcurl"
brew "gitleaks"
brew "helm"
brew "jq"
brew "htop"
brew "k9s"
brew "kube-bench"
brew "kubernetes-cli"
brew "kustomize"
brew "kompose"
brew "kcat"
brew "ncdu"
brew "openstackclient"
brew "nvm"
brew "midnight-commander"
brew "nmap"
brew "node"
brew "opentofu"
brew "python@3.14"
brew "powershell"
brew "pre-commit"
brew "prometheus"
brew "pyenv"
brew "terragrunt"
brew "terraform-docs"
brew "tflint"
brew "trivy"
brew "checkov"
brew "powerlevel10k"
brew "aws/tap/eksctl"
brew "watch"
brew "wireshark"
brew "qemu"
brew "redis"
brew "bind"
brew "rclone"
brew "tfenv"
brew "yamllint"
brew "yq"
brew "zsh"
brew "wireguard-tools"
cask "font-meslo-lg-nerd-font"
cask "maccy"
cask "bettertouchtool"
cask "dbeaver-community"
cask "drawio"
cask "iterm2"
cask "lens"
cask "lm-studio"
cask "obsidian"
cask "postman"
cask "raycast"
cask "notion"
cask "sourcetree"
cask "stats"
cask "shottr"
cask "visual-studio-code"
cask "windows-app"
cask "wireshark-app"
cask "cursor"
cask "chatgpt"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "codezombiech.gitignore"
vscode "cweijan.vscode-redis-client"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "jgclark.vscode-todo-highlight"
vscode "mhutchie.git-graph"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "okteto.remote-kubernetes"
vscode "openai.chatgpt"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "shellomo.statusbar-notes"
vscode "teabyii.ayu"
vscode "tim-koehler.helm-intellisense"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-java-upgrade"
vscode "wayou.vscode-todo-highlight"
vscode "zainchen.json"
vscode "gruntfuggly.todo-tree"
vscode "eamodio.gitlens"
vscode "usernamehw.errorlens"
